#โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
#	หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
#	หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
#	หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
#	หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
#	หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
#	หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('-------------------------------')
print('    โปรแกรมตรวจสอบสายรถเมล์  ')
print('-------------------------------')
 
car_number = input('ป้อนสายรถ: ')
if car_number == '57' :
    print(f'ไปปิ่นเกล้า บางขุนนนท์')
elif car_number == '3' :
    print(f'ไปสนามหลวง ลาดพร้าว')
elif car_number == '71' :
    print(f'ไปหัวลำโพง เยาวราช')
elif car_number == '56' :
    print(f'ไปบางลำพู สะพานกรุงธน')
elif car_number == '539' :
    print(f'ไปอนุสาวรีย์ชัย สามเสน')
else :
    print('ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม')