# กรณี 1 print() มีผลข้อมูลหลายประเภททำไง???
# วิธีที่ 1 ใช้ , (โดยการแสดงผลตรงจุดที่ , จะเป็นการเว้น 1 space)
print('Hello',555,'Wow',999,True,'Hi',10+20,152.875)

# วิธีที่ 2 ใช้ + (ข้อมูลไหนที่ไม่ใช้ string ต้องทำให้เป้น string ใช้ฟังก์ชัน str())
# ไม่มีเว้น 1 space เหมือน ,
print('Hello'+str(555)+'Wow'+str(999)+str(True)+'Hi'+str(10+20)+str(152.875))
print('Hello'+str(555)+'Wow'+str(999)+str(True)+'Hi'+str(10+20-5)+str(152.875))
# วิธีที่ 3 ใช้เมฮอต format() โดยข้อมูลที่อยู่ในรูปแบบของ string
# (ข้อมูลที่ไม่ใช้ string ให้ใส่ใน () ของ format และตำปหน่งที่แทนข้อมูลนั้นให้ใส่ {} แทน)
print('hello {} wow {} {} Hi {} {}'.format{555,999,true,10+20-5,152.875})

# index number
print('{2} {4}'.format('a','b','c','d','e'))

# วิธีที่ 4 ใช้ f-string โดยข้อมูลแสดงอยู่ในรูปแบบของ string โดยมี f อยู่ข้างหน้า
# (ข้อมูลที่ไม่ใช้ string ให้เขียนใส่ใน {} ณ ตำแหน่งนั้นๆ เลย)
print(f'hello {555} wow {999} {true} hi {10+20-5} {152.875}')