# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

print('-----------------------')
print(' โปรแกรมคำนวณผลคูณ')
print('-----------------------')

while True :
    num1 = int(input('ป้อนตัวเลขที่1: '))
    num2 = int(input('ป้อนตัวเลขที่2: '))
    
    result = num1 * num2
    if result <= 5000 :
        print('ผลคูณ =', result)
    if result > 5000 :
        print('เกินจำนวนที่กำหนด')
        break